In [ ]:
#workflow for adding new data to the database

In [ ]:
# push data up to database
# ensure its not duplicate -> if duplicate then delete
# assign it test or train status

In [2]:
import psycopg2
from sqlalchemy import create_engine
import pandas as pd

In [3]:
#connect to the database
PASSWORD = pd.read_pickle('~/DataScienceJobs/data/SQL_password.pkl')
engine = create_engine('postgresql://postgres:'+PASSWORD.iloc[0,0]+'@dsj-1.c9mo6xd9bf9d.us-west-2.rds.amazonaws.com:5432/')

In [ ]:
# append to stick it on the end and, replace to update
data_to_database.to_sql(name = 'all_data',con = engine, if_exists='append',  index=False)

In [12]:
# check number of rows

pd.read_sql("SELECT count(*) FROM all_data", engine)

   count
0  16110

In [38]:
engine.execute(" ALTER TABLE all_data DROP COLUMN train_test")

In [13]:
# drop ads with duplicated descriptions

engine.execute(" DELETE FROM all_data a USING all_data b WHERE a.id < b.id AND a.description = b.description;")

In [14]:
pd.read_sql("SELECT count(*) FROM all_data", engine)

   count
0  16079

In [4]:
#assign test or train status to each entry at random
#engine.execute("ALTER TABLE all_data ADD train_test CHAR")

In [10]:
# change column data type
#engine.execute('''ALTER TABLE all_data ALTER COLUMN train_test SET DATA TYPE float USING train_test::double precision''')

In [15]:
pd.read_sql("SELECT * FROM all_data LIMIT 10", engine)

,index,job_title,ref_code,company,description,salary,salary_low,salary_high,currency,salary_average,...,location,jobtype,posted_date,extraction_date,country,region,url,id,train_test,train_test_label
0,NaN,Data Analyst,None,Zylo,['SaaS changed the way software is purchased. ...,None,NaN,NaN,None,NaN,...,"Indianapolis, IN",None,2019-11-08,None,USA,Indiana,https://www.indeed.com/rc/clk?jk=af09d0ba7e6d6...,26417,0.393437,train
1,NaN,Data Scientist,02/10/19_1570002973,"Reading-£65,000 - Churchill Frank",Job DescriptionRole & Responsibilities develop...,None,NaN,NaN,None,NaN,...,Reading,permanent,2019-10-24,None,United Kingdom,South East,https://job-openings.monster.co.uk/data-scient...,26828,0.831816,train
2,NaN,Data Analyst (Graduate),None,Tandem Bank,\n We all work together along with stakeholder...,None,NaN,NaN,£,NaN,...,London,None,2019-11-08 00:00:00,2019-11-13,UK,London,None,166,0.844503,train
3,124.0,Software Engineer,50002,Harnham,- berlin germany ...,€65000 - €75000 per annum + benefits,65000.0,75000.0,€,70000.0,...,Berlin,Permanent,None,2019-11-14,GER,Berlin,https://www.harnham.com/job/software-engineer-...,167,0.574755,train
4,125.0,4MAT,00048DP,Harnham,berlin - hast du berei...,€60 - €70 per annum,60000.0,70000.0,€,65000.0,...,Berlin,Permanent,None,2019-11-14,GER,Berlin,https://www.harnham.com/job/senior-marketing-d...,168,0.674703,train
5,NaN,Client Services/Data Analytics Intern (Spring ...,None,Canvs,"[""Canvs is the industry standard for topical a...",$15 an hour,15.0,15.0,$,15.0,...,"New York, NY 10004 (Financial District area)",None,2019-11-06,None,USA,New York,https://www.indeed.com/rc/clk?jk=587a0c342159d...,10510,0.169232,test
6,NaN,Energy and Sustainability Data Analyst,None,The RMR Group,['Overview\nCollaborate with the National and ...,C had approximately $30.6 billion of total ass...,30.0,30.0,$,30.0,...,"Newton, MA 02458",None,2019-11-15,None,USA,Massachusetts,https://www.indeed.com/rc/clk?jk=71d5f25550c77...,10511,0.184600,test
7,NaN,Tech lead - full stack web development - AI st...,None,Archangel Imaging,"\n We are looking for an exceptional, proactiv...","£50,000 - £70,000 a year",50000.0,70000.0,£,60000.0,...,Harwell,None,None,2019-11-18,UK,South East,None,27023,NaN,None
8,NaN,PHD Freelance Tutor,None,A EDUCATION LTD,\n We are in sore need of numerous excellent t...,"£1,500 - £2,000 a month",1500.0,2000.0,£,1750.0,...,London,"Part-time, Temporary, Contract, Commission",None,2019-11-18,UK,London,None,27024,NaN,None
9,NaN,Operations Associate,None,Converge,\n As the Operations Associate at Converge you...,None,NaN,NaN,£,NaN,...,London,None,None,2019-11-18,UK,London,None,27025,NaN,None

In [16]:
# allocate train and tes columns
engine.execute(''' UPDATE all_data 
                    SET train_test_label = CASE 
                                            WHEN random() > 0.2 THEN 'train'
                                            ELSE 'test'
                                            END 
                    WHERE train_test_label IS NULL''')

In [17]:
pd.read_sql("SELECT * FROM all_data LIMIT 10", engine)

,index,job_title,ref_code,company,description,salary,salary_low,salary_high,currency,salary_average,...,location,jobtype,posted_date,extraction_date,country,region,url,id,train_test,train_test_label
0,NaN,Data Analyst,None,Zylo,['SaaS changed the way software is purchased. ...,None,NaN,NaN,None,NaN,...,"Indianapolis, IN",None,2019-11-08,None,USA,Indiana,https://www.indeed.com/rc/clk?jk=af09d0ba7e6d6...,26417,0.393437,train
1,NaN,Data Scientist,02/10/19_1570002973,"Reading-£65,000 - Churchill Frank",Job DescriptionRole & Responsibilities develop...,None,NaN,NaN,None,NaN,...,Reading,permanent,2019-10-24,None,United Kingdom,South East,https://job-openings.monster.co.uk/data-scient...,26828,0.831816,train
2,NaN,Data Analyst (Graduate),None,Tandem Bank,\n We all work together along with stakeholder...,None,NaN,NaN,£,NaN,...,London,None,2019-11-08 00:00:00,2019-11-13,UK,London,None,166,0.844503,train
3,124.0,Software Engineer,50002,Harnham,- berlin germany ...,€65000 - €75000 per annum + benefits,65000.0,75000.0,€,70000.0,...,Berlin,Permanent,None,2019-11-14,GER,Berlin,https://www.harnham.com/job/software-engineer-...,167,0.574755,train
4,125.0,4MAT,00048DP,Harnham,berlin - hast du berei...,€60 - €70 per annum,60000.0,70000.0,€,65000.0,...,Berlin,Permanent,None,2019-11-14,GER,Berlin,https://www.harnham.com/job/senior-marketing-d...,168,0.674703,train
5,NaN,Client Services/Data Analytics Intern (Spring ...,None,Canvs,"[""Canvs is the industry standard for topical a...",$15 an hour,15.0,15.0,$,15.0,...,"New York, NY 10004 (Financial District area)",None,2019-11-06,None,USA,New York,https://www.indeed.com/rc/clk?jk=587a0c342159d...,10510,0.169232,test
6,NaN,Energy and Sustainability Data Analyst,None,The RMR Group,['Overview\nCollaborate with the National and ...,C had approximately $30.6 billion of total ass...,30.0,30.0,$,30.0,...,"Newton, MA 02458",None,2019-11-15,None,USA,Massachusetts,https://www.indeed.com/rc/clk?jk=71d5f25550c77...,10511,0.184600,test
7,NaN,Marketing Analytics and Customer Behavior Busi...,None,Amazon UK Services Ltd,\n We are currently looking for a Marketing An...,None,NaN,NaN,£,NaN,...,London,None,2019-10-14 00:00:00,2019-11-13,UK,London,None,42,0.910029,train
8,NaN,Production Mananger - Packing,None,Butcher s Pet Care Ltd,\n Lean methodology / Businesses improvement i...,"£40,000 a year",40000.0,40000.0,£,40000.0,...,Northampton NN6,None,2019-11-12 00:00:00,2019-11-13,UK,East Midlands,None,43,0.521043,train
9,NaN,Senior Data Scientist,000_106,WHITEHAT ANALYTICS LIMITED,ABOUT WHITEHAT ANALYTICSWhitehat Analytics is ...,None,NaN,NaN,None,NaN,...,London,permanent,2019-10-23,None,United Kingdom,London,https://job-openings.monster.co.uk/senior-data...,26841,0.037895,test

In [47]:
test = pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'test'
''', engine)
train = pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'train'
''', engine)

test_sal = pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'test' AND salary_average > 0
''', engine)
train_sal = pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'train' AND salary_average > 0
''', engine)

test_UK = pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'test' AND salary_average > 0 AND country = 'UK'
''', engine)
train_UK = pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'train' AND salary_average > 0 AND country = 'UK'
''', engine)

test_GER= pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'test' AND salary_average > 0 AND country = 'Germany'
''', engine)
train_GER = pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'train' AND salary_average > 0 AND country = 'Germany'
''', engine)

test_USA = pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'test' AND salary_average > 0 AND country = 'USA'
''', engine)
train_USA = pd.read_sql('''SELECT count(train_test_label) from all_data WHERE train_test_label = 'train' AND salary_average > 0 AND country = 'USA'
''', engine)


print("Samples in test set : {} ".format(test.iloc[0,0]))
print("Samples in train set : {} ".format(train.iloc[0,0]))
print("Proportion of test samples : {:.1%} ".format(test.iloc[0,0]/(train.iloc[0,0]+test.iloc[0,0])))
print("")
print("Samples in test set with salary: {} ".format(test_sal.iloc[0,0]))
print("Samples in train set with salary: {} ".format(train_sal.iloc[0,0]))
print("Proportion of test samples with salary: {:.1%} ".format(test_sal.iloc[0,0]/(train_sal.iloc[0,0]+test_sal.iloc[0,0])))
print("")
print("Samples in test set with salary UK: {} ".format(test_UK.iloc[0,0]))
print("Samples in train set with salary UK: {} ".format(train_UK.iloc[0,0]))
print("Proportion of test samples with salary UK: {:.1%} ".format(test_UK.iloc[0,0]/(train_UK.iloc[0,0]+test_UK.iloc[0,0])))
print("")
print("Samples in test set with salary Germany: {} ".format(test_GER.iloc[0,0]))
print("Samples in train set with salary  Germany: {} ".format(train_GER.iloc[0,0]))
print("Proportion of test samples with salary  Germany: {:.1%} ".format(test_GER.iloc[0,0]/(train_GER.iloc[0,0]+test_GER.iloc[0,0])))
print("")
print("Samples in test set with salary USA: {} ".format(test_USA.iloc[0,0]))
print("Samples in train set with salary  USA: {} ".format(train_USA.iloc[0,0]))
print("Proportion of test samples with salary  USA: {:.1%} ".format(test_USA.iloc[0,0]/(train_USA.iloc[0,0]+test_USA.iloc[0,0])))

Samples in test set : 3137
Samples in train set : 12942
Proportion of test samples : 19.5%

Samples in test set with salary: 1276
Samples in train set with salary: 5153
Proportion of test samples with salary: 19.8%

Samples in test set with salary UK: 0
Samples in train set with salary UK: 0
Proportion of test samples with salary UK: nan%

Samples in test set with salary Germany: 23
Samples in train set with salary  Germany: 98
Proportion of test samples with salary  Germany: 19.0%

Samples in test set with salary USA: 0
Samples in train set with salary  USA: 0
Proportion of test samples with salary  USA: nan%

C:\Users\lundr\AppData\Local\Continuum\anaconda3\envs\dsj\lib\site-packages\ipykernel_launcher.py:37: RuntimeWarning: invalid value encountered in longlong_scalars
C:\Users\lundr\AppData\Local\Continuum\anaconda3\envs\dsj\lib\site-packages\ipykernel_launcher.py:45: RuntimeWarning: invalid value encountered in longlong_scalars

In [ ]:
### add a new column
engine.execute(''' ALTER TABLE all_data ADD COLUMN train_test_label text''')

In [44]:
engine.execute(''' UPDATE all_data 
                    SET country  = CASE 
                                    WHEN country = 'GER' THEN 'Germany'
                                   END 
                    ''')

In [45]:
df = pd.read_sql('''SELECT * from all_data WHERE country = 'Germany' AND company = 'Harnham' AND salary_average > 0
''', engine)

In [93]:
df = pd.read_sql('''SELECT * from all_data''',  engine)

In [49]:
df.head()

,index,job_title,ref_code,company,description,salary,salary_low,salary_high,currency,salary_average,...,salary_type,location,jobtype,posted_date,extraction_date,country,region,url,id,train_test_label
0,NaN,Data Analyst,None,Zylo,['SaaS changed the way software is purchased. ...,None,NaN,NaN,None,NaN,...,None,"Indianapolis, IN",None,2019-11-08,None,None,Indiana,https://www.indeed.com/rc/clk?jk=af09d0ba7e6d6...,26417,train
1,NaN,Data Scientist,02/10/19_1570002973,"Reading-£65,000 - Churchill Frank",Job DescriptionRole & Responsibilities develop...,None,NaN,NaN,None,NaN,...,None,Reading,permanent,2019-10-24,None,None,South East,https://job-openings.monster.co.uk/data-scient...,26828,train
2,NaN,Data Analyst (Graduate),None,Tandem Bank,\n We all work together along with stakeholder...,None,NaN,NaN,£,NaN,...,None,London,None,2019-11-08 00:00:00,2019-11-13,None,London,None,166,train
3,NaN,Client Services/Data Analytics Intern (Spring ...,None,Canvs,"[""Canvs is the industry standard for topical a...",$15 an hour,15.0,15.0,$,15.0,...,hourly,"New York, NY 10004 (Financial District area)",None,2019-11-06,None,None,New York,https://www.indeed.com/rc/clk?jk=587a0c342159d...,10510,test
4,NaN,Energy and Sustainability Data Analyst,None,The RMR Group,['Overview\nCollaborate with the National and ...,C had approximately $30.6 billion of total ass...,30.0,30.0,$,30.0,...,None,"Newton, MA 02458",None,2019-11-15,None,None,Massachusetts,https://www.indeed.com/rc/clk?jk=71d5f25550c77...,10511,test

In [5]:
import os
os.getcwd()
#os.chdir('..')

'C:\\Users\\lundr\\DataScienceJobs'

In [94]:
# ooops I acidentally deleted all of the countries in the db....not to fix
df_1 = pd.read_csv('data/locations.csv')[['region','country']]
df_2 = pd.read_csv('data/uk_location_lookup.csv')[['region','country']]
df_3 = pd.read_csv('data/us-states.csv')[['location','country']]
df_4 = pd.read_csv('data/us-states.csv')[['region','country']]
df_3.columns = ['region','country']

lookup = pd.concat([df_1,df_2,df_3,df_4],axis = 0)

In [95]:
import numpy as np
# Create a zip object from two lists
zipbObj = zip(lookup['region'], lookup['country'])
 
# Create a dictionary from zip object
lookup_dict = dict(zipbObj)
lookup_dict['None'] = np.nan
lookup_dict['South West England'] = 'UK'
lookup_dict['Canada'] = 'Canada'
lookup_dict['Yorkshire and the Humber'] = 'UK'
lookup_dict['East midlands'] = 'UK'
lookup_dict['Gibraltar'] = 'UK'

In [96]:
# match the region to get the country
df["country"] = df["region"].apply(lambda x: lookup_dict.get(x))

In [97]:
# Now change state codes to full names
df_5 = pd.read_csv('data/us-states.csv')[['region','location']]
zipbObj_2 = zip(df_5['region'], df_5['location'])
states_dict = dict(zipbObj_2)

SyntaxError: invalid syntax (<ipython-input-88-e259212707cd>, line 1)

In [98]:
for i in range(len(df)):
    if states_dict.get(df["region"][i]):
        df['region'][i] = states_dict.get(df['region'][i])
    else:
        pass

C:\Users\lundr\AppData\Local\Continuum\anaconda3\envs\dsj\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [99]:
df['region'].unique()

array(['Indiana', 'South East', 'London', 'New York', 'Massachusetts',
       'East Midlands', 'Yorkshire and The Humber', 'Nordrhein-Westfalen',
       'South West', 'Texas', 'California', 'Maryland', 'Hamburg',
       'Pennsylvania', 'Scotland', 'Florida', 'Washington', 'Tennessee',
       'Kentucky', 'Bayern', 'Illinois', 'UK Unknown', 'North Carolina',
       None, 'Baden-Württemberg', 'North West', 'East of England',
       'West Midlands', 'Alabama', 'Wales', 'South West England',
       'Georgia', 'Berlin', 'Utah', 'Virginia', 'North East',
       'West Virginia', 'East', 'Sachsen', 'Offshore', 'Ohio', 'Hessen',
       'Brandenburg', 'Colorado', 'Rheinland-Pfalz', 'Sachsen-Anhalt',
       'Nebraska', 'Arizona', 'Minnesota', 'Connecticut', 'Niedersachsen',
       'Oregon', 'New Jersey', 'Northern Ireland', 'Wisconsin', 'Masovia',
       'Saarland', 'Oklahoma', 'Nevada', 'New Mexico', 'Washington DC',
       'Iowa', 'Mississippi', 'Arkansas', 'Delaware', 'Louisiana',
       'Kansas', 'Alaska', 'Tasmania', 'Victoria', 'Schleswig-Holstein',
       'Vermont', 'Mecklenburg-Vorpommern', 'South Dakota', 'Bremen',
       'Wyoming', 'Idaho', 'Michigan', 'Missouri', 'North Dakota',
       'Montana', 'Brussels', 'Leinster', 'Zurich', 'Thüringen', 'Hawaii',
       'Canada', 'Yorkshire and the Humber', 'East midlands',
       'New Hampshire', 'South Carolina', 'Barcelona', 'Ile-de-France',
       'North Holland', 'Bern', 'Rhode Island', 'Maine', 'South Holland',
       'Gibraltar', 'North Brabant', 'Vilnius'], dtype=object)

In [117]:
df_2 = df[1000:]

In [118]:
# append to stick it on the end and, replace to update
df_2.to_sql(name = 'all_data',con = engine, if_exists='append',  index=False)

In [132]:
engine.execute(''' INSERT INTO all_data 
SELECT * ,  NULL as train_test_label, NULL as index FROM landing ''')

ProgrammingError: (psycopg2.errors.DatatypeMismatch) column "index" is of type double precision but expression is of type text
LINE 2: SELECT * ,  NULL as train_test_label, NULL as index FROM lan...
               ^
HINT:  You will need to rewrite or cast the expression.

[SQL:  INSERT INTO all_data
SELECT * ,  NULL as train_test_label, NULL as index FROM landing ]
(Background on this error at: http://sqlalche.me/e/f405)

In [133]:
engine.execute('''
    INSERT INTO all_data (job_title, ref_code, company,description, salary,salary_low,salary_high,currency,salary_average,salary_low_euros,salary_high_euros,salary_average_euros,salary_type,location,jobtype,posted_date,extraction_date,country,region,url)
    SELECT job_title, ref_code, company,description, salary,salary_low,salary_high,currency,salary_average,salary_low_euros,salary_high_euros,salary_average_euros,salary_type,location,jobtype,posted_date,extraction_date,country,region,url FROM landing
''')

In [134]:
pd.read_sql("SELECT count(*) FROM all_data", engine)

   count
0  19416

In [135]:
engine.execute('''UPDATE all_data SET country = 'UK' WHERE country = 'United Kingdom' ''')

In [136]:
pd.read_sql('SELECT count(*), country FROM all_data GROUP BY country', engine)

    count      country
0     360         None
1       1    Lithuania
2       1        Spain
3       7  Switzerland
4       1      Belgium
5       3       Sweden
6       1       France
7    5185          USA
8       6  Netherlands
9       2    Australia
10      1       Poland
11  11723           UK
12      1      Ireland
13   2111      Germany
14     13       Canada

In [4]:
engine.execute('''DELETE FROM landing ''')

In [8]:
engine.execute('''UPDATE all_data SET region = 'East of England' WHERE region = 'East' ''')